#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.deployment.data.google_client_config.provider: Reading...
module.deployment.data.google_container_cluster.my_cluster: Reading...
module.deployment.data.google_client_config.provider: Read complete after 0s [id=projects/"off-net-dev"/regions/"northamerica-northeast1"/zones/<null>]
module.deployment.data.google_container_cluster.my_cluster: Read complete after 8s [id=projects/off-net-dev/locations/northamerica-northeast1/clusters/java-rest-app]
module.deployment.kubernetes_namespace.staging: Refreshing state... [id=staging]
module.deployment.kubernetes_namespace.dev: Refreshing state... [id=development]
module.deployment.kubernetes_namespace.env: Refreshing state... [id=namespace-staging]
module.deployment.kubernetes_deployment.deployment: Refreshing state... [id=namespace-staging/java-rest-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.deployment.kubernetes_deployment.deployment must be replaced
-/+ resource "kubernetes_deployment" "deployment" {
      ~ id               = "namespace-staging/java-rest-app" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {
              - "autopilot.gke.io/resource-adjustment" = jsonencode(
                    {
                      - input    = {
                          - containers = [
                              - {
                                  - name = "spring-boot-rest-app-1"
                                },
                            ]
                        }
                      - modified = true
                      - output   = {
                          - containers = [
                              - {
                                  - limits   = {
                                      - ephemeral-storage = "1Gi"
                                    }
                                  - name     = "spring-boot-rest-app-1"
                                  - requests = {
                                      - cpu               = "500m"
                                      - ephemeral-storage = "1Gi"
                                      - memory            = "2Gi"
                                    }
                                },
                            ]
                        }
                    }
                )
              - "autopilot.gke.io/warden-version"      = "31.23.0-gke.9"
            } -> null
          ~ generation       = 1 -> (known after apply)
            name             = "java-rest-app"
          ~ namespace        = "namespace-staging" -> "namespace-development" # forces replacement
          ~ resource_version = "139237" -> (known after apply)
          ~ uid              = "500309d2-defe-4aa3-a26f-9eb609ea861d" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ strategy (known after apply)
          - strategy {
              - type = "RollingUpdate" -> null

              - rolling_update {
                  - max_surge       = "25%" -> null
                  - max_unavailable = "25%" -> null
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (3 unchanged attributes hidden)
                }
              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  - node_selector                    = {} -> null
                  ~ scheduler_name                   = "default-scheduler" -> (known after apply)
                  + service_account_name             = (known after apply)
                    # (12 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image                      = "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:staging" -> "northamerica-northeast1-docker.pkg.dev/off-net-dev/lendly-demo/spring-boot-rest-app:latest"
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "spring-boot-rest-app-1"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ resources (known after apply)
                      - resources {
                          - limits   = {
                              - "ephemeral-storage" = "1Gi"
                            } -> null
                          - requests = {
                              - "cpu"               = "500m"
                              - "ephemeral-storage" = "1Gi"
                              - "memory"            = "2Gi"
                            } -> null
                        }

                      - security_context {
                          - allow_privilege_escalation = false -> null
                          - privileged                 = false -> null
                          - read_only_root_filesystem  = false -> null
                          - run_as_non_root            = false -> null
                            # (2 unchanged attributes hidden)

                          - capabilities {
                              - add  = [] -> null
                              - drop = [
                                  - "NET_RAW",
                                ] -> null
                            }
                        }
                    }

                  ~ image_pull_secrets (known after apply)

                  ~ readiness_gate (known after apply)

                  - security_context {
                      - run_as_non_root        = false -> null
                      - supplemental_groups    = [] -> null
                        # (4 unchanged attributes hidden)

                      - seccomp_profile {
                          - type              = "RuntimeDefault" -> null
                            # (1 unchanged attribute hidden)
                        }
                    }

                  - toleration {
                      - effect             = "NoSchedule" -> null
                      - key                = "kubernetes.io/arch" -> null
                      - operator           = "Equal" -> null
                      - value              = "amd64" -> null
                        # (1 unchanged attribute hidden)
                    }
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.deployment.kubernetes_namespace.env must be replaced
-/+ resource "kubernetes_namespace" "env" {
      ~ id                               = "namespace-staging" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {} -> null
          ~ name             = "namespace-staging" -> "namespace-development" # forces replacement
          ~ resource_version = "139142" -> (known after apply)
          ~ uid              = "d4dcdaaa-9674-4d15-a0a4-17f07e6c34d5" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.deployment.kubernetes_service.my_service will be created
  + resource "kubernetes_service" "my_service" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "my-service"
          + namespace        = "namespace-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "java-rest-app"
            }
          + session_affinity                  = "None"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 80
              + protocol    = "TCP"
              + target_port = "8080"
            }

          + session_affinity_config (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @lendly-telus-com, Action: `pull_request`*